Ezapataq07/STM32_UNAL/VL53L3CX_SimpleRanging_F411/Core/Src/LiDAR_Main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : LiDAR_Main.c
 * @author         : Emanuel Zapata Querubin
 * @brief          : Desarrollo del Programa para el Sensor LiDAR 2D
 ******************************************************************************
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* Se incluyen las libreías necesarias */
#include "stm32xxx_hal.h"
#include "vl53lx_api.h"
#include "vl53lx_def.h"
#include "53L3A2.h"
#include "stdio.h"
#include "stdbool.h"
#include "BasicTimer.h"
#include "StepMotorDriver.h"
#include "SysTickDriver.h"
#include "GPIOxDriver.h"
#include "USARTxDriver.h"
#include "FPU_Driver.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define SIZE_RANGING_DATA	512
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/


/* USER CODE BEGIN PV */
VL53LX_Dev_t                   dev;
VL53LX_DEV                     Dev = &dev;
int status;
volatile int IntCount;
#define isInterrupt 1

I2C_HandleTypeDef hi2c1;
UART_HandleTypeDef huart2;

/* Definición de handlers */
GPIO_Handler_t 		handlerStateLED 					= {0};
BTIMER_Handler_t	handlerStateLedTimer				= {0};
GPIO_Handler_t 		handlerRxPIN	 					= {0};
GPIO_Handler_t 		handlerTxPIN	 					= {0};
USART_Handler_t		handlerUSART1						= {0};
GPIO_Handler_t		encoderOutA							= {0};
GPIO_Handler_t		encoderOutB							= {0};
uint8_t				encoderChannels[2]					= {0};

/* Definición de los handlers que controlan las bobinas del motor */
GPIO_Handler_t		IN1 								= {0};
GPIO_Handler_t		IN2 								= {0};
GPIO_Handler_t		IN3 								= {0};
GPIO_Handler_t		IN4 								= {0};

/* Handlers para el suicheo del sensor */
GPIO_Handler_t 		VL53L3CX_VDD						= {0};

/* Definicion de vairables */
// Para manejo de errores en la medición de distancias
uint16_t 			numMeasurmentErrors 				= 0;
uint8_t				errorMultipleObjects				= 0;
uint8_t				RangeErrors[50]						= {0};
uint8_t				RangeStatus     					= 0;

// Para el control del motor
uint16_t			motorStatus							= 0;
uint16_t			motorDegree							= 0;
StepMotor_Handler_t StepMotor							= {0};

// Para la comunicación USART
char				bufferReception[32]					= {0};
char				bufferData[100]						= {0};
char				rxData 								= '\0';
uint16_t			counterReception					= 0;

// Para el control por comandos
unsigned int		firstParameter 						= 0;
unsigned int		secondParameter						= 0;
char				cmd[32] 							= {0};
char				userMsg[32] = {0};
bool				stringComplete						= false;

// Para el control de la medición
float				rangingData[SIZE_RANGING_DATA]		= {0};
float				meanRangingData						= 0;
float				angleData[SIZE_RANGING_DATA]		= {0};
uint16_t			counterRangigData					= 0;
float				Pulses = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_I2C1_Init(void);
/* USER CODE BEGIN PFP */
/* Definición de los prototipos */
void RangingLoop(void);
void RangingMeasurment(void);
void initSystem(void);
void Initial_Boot_VL53L3CX(void);
void RangeErrorsMsg(uint8_t status);
void RebootVL53L3CX(void);
void parseCommands(char *ptrBufferReception);
void stepMotorMove(StepMotor_Handler_t *pStepMotor, uint16_t numSteps, uint8_t direction);
void LiDAR_Start(void);
void getRangingData(void);
void WelcomeMsg(void);
void StaticRanging(unsigned int numData);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#ifdef __GNUC__
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
  HAL_UART_Transmit(&huart2, (uint8_t *)&ch, 1, HAL_MAX_DELAY);
  return ch;
}

/* Implementación del Callback para mediciones por interrupciones */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin==VL53L1X_INT_Pin)
  {
    IntCount++;
  }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  initSystem();
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */

  /**Configure the Systick interrupt time
  */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  /**Configure the Systick
  */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

  // Mensaje de bienvenida
  WelcomeMsg();


  Dev->I2cHandle = &hi2c1;
  Dev->I2cDevAddr = 0x52;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	// Las siguientes operaciones se ejecutan cuando el USART utilizado reciba información
	if (rxData != '\0'){
		// Se comienzan a acumular los caracteres recibidos en un buffer
		bufferReception[counterReception] = rxData;
		counterReception++;
		// Si se recibe el caracter @ se activa la variable de estado que indica que se recibió la información necesaria
		if (rxData == '@'){
			stringComplete = true;
			bufferReception[counterReception] = '\0';  // Se hace nulo la posición del caracter @
			counterReception = 0;
		}
		rxData = '\0'; // Se hace nulo la variable rxData con el fin de que sólo se entre a la condición cuando el Usart recibe datos
	}
	// Las siguientes operaciones se ejecutan cuando el buffer de recepción tiene la información completa
	if (stringComplete){
		// Se llama a la función parseCommands, la cual ejecuta el código correspondiente al comando enviado vía USART
		stringComplete = false;
		parseCommands(bufferReception);
	}
    /* USER CODE END WHILE */

