Ezapataq07/STM32_UNAL/VL53L3CX_SimpleRanging_F411/Core/Src/LiDAR_Main.c
    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

  /* USER CODE BEGIN I2C1_Init 1 */

  /* USER CODE END I2C1_Init 1 */
  hi2c1.Instance = I2C1;
  hi2c1.Init.ClockSpeed = 100000;
  hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
  hi2c1.Init.OwnAddress1 = 0;
  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c1.Init.OwnAddress2 = 0;
  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C1_Init 2 */

  /* USER CODE END I2C1_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : VL53L1X_INT_Pin */
  GPIO_InitStruct.Pin = VL53L1X_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(VL53L1X_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI4_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI4_IRQn);

}

/* USER CODE BEGIN 4 */

void parseCommands(char *ptrBufferReception){
	/**
	 * La función parseCommands se encarga del control del programa por medio de comandos mediante el USART
	 */
	// Se toma la información del buffer recibido, leyendo el comando y el parámetro ingresado
	sscanf(ptrBufferReception, "%s %u %u %s",  cmd, &firstParameter, &secondParameter, userMsg);
	// Se ejecuta si el comando es "Menu"
	if (strcmp(cmd, "Menu") == 0){
		// Se imprime el Menu de comandos
		writeMsg(&handlerUSART1, "\nHelp Menu CMDS:\n");
		writeMsg(&handlerUSART1, "1)  Menu              -- Print this menu\n");
		writeMsg(&handlerUSART1, "8)  initToF           -- Initialize ToF Sensor\n");
		writeMsg(&handlerUSART1, "2)  Start             -- Start LiDAR Ranging\n");
		writeMsg(&handlerUSART1, "3)  getData           -- Returns the ranging measurment\n");
		writeMsg(&handlerUSART1, "4)  readEncoder       -- Step motor moves 180° and Encoder output is shown\n");
		writeMsg(&handlerUSART1, "5)  moveStep # #      -- Step motor moves #1 of steps in #2 direction (#2: 0->CW; 1->CCW)\n");
		writeMsg(&handlerUSART1, "6)  moveDegree # #    -- Step motor moves #1 degrees in #2 direction (#2: 0->CW; 1->CCW)\n");
		writeMsg(&handlerUSART1, "7)  staticRanging #   -- Perform # ranging measurments with the motor static\n");
	}
	// Inicializar el Sensor ToF para poder comenzar a medir
	else if (strcmp(cmd, "initToF") == 0){
		writeMsg(&handlerUSART1, "CMD: initToF\n");
		Initial_Boot_VL53L3CX();
	}
	// Se comienza la acción principal del sensor, hacer el mapeo de la superficie 2D
	else if (strcmp(cmd, "Start") == 0){
		writeMsg(&handlerUSART1, "CMD: Start\n");
		LiDAR_Start();
	}
	// Se imprimen los datos medidos en el mapeo
	else if (strcmp(cmd, "getData") == 0){
		writeMsg(&handlerUSART1, "CMD: getData\n");
		getRangingData();
	}
	// Se imprimen las salidas del Encoder mientras el motor hace un movimiento específico
	else if (strcmp(cmd, "readEncoder") == 0){
		writeMsg(&handlerUSART1, "CMD: readEncoder\n");
		for (uint16_t i = 0; i < 512; i++){
			stepMotorMove(&StepMotor, 2, CLOCKWISE);
			readEncoder(encoderChannels);
			sprintf(bufferData, "Out A = %u   Out B = %u\n", (unsigned int) encoderChannels[0], (unsigned int) encoderChannels[1]);
			writeMsg(&handlerUSART1, bufferData);
			HAL_Delay(10);
		}
		stepMotorMove(&StepMotor, 1024, COUNTERCLOCKWISE);
	}
	// Se hace un movimiento del motor una cantidad específica de pasos en cierta dirección
	else if (strcmp(cmd, "moveStep") == 0){
		writeMsg(&handlerUSART1, "CMD: moveStep\n");
		stepMotorMove(&StepMotor, (uint16_t) firstParameter, (uint8_t) secondParameter);
	}
	// Se hace un movimiento del motor una cantidad específica de grados en cierta dirección
	else if (strcmp(cmd, "moveDegree") == 0){
		writeMsg(&handlerUSART1, "CMD: moveDegree\n");
		motorDegree = (uint16_t)	firstParameter;
		motorDegree = (motorDegree*2048)/360;
		stepMotorMove(&StepMotor, motorDegree, (uint8_t) secondParameter);
	}
	// Se hacen mediciones de distancia sin movimiento del motor
	else if (strcmp(cmd, "staticRanging") == 0){
		writeMsg(&handlerUSART1, "CMD: staticRanging\n");
		StaticRanging(firstParameter);
	}
	else {
		// En caso de que el comando no sea ninguno de los anteriores, se indica por consola que es incorrecto
		writeMsg(&handlerUSART1, "Incorrect Command!!!\n");
	}
}

void stepMotorMove(StepMotor_Handler_t *pStepMotor, uint16_t numSteps, uint8_t direction){
	for (uint16_t k = 0; k < numSteps; k++){
		motorStatus = moveStepMotor(&StepMotor, 1, direction);
		if (motorStatus == WARNING_WRONG_DIRECTION){
			writeMsg(&handlerUSART1, "The motor moved in the incorrect direction\n");
		}
	}
}

void LiDAR_Start(void){
	/**
	 * LiDAR_Start es la funcionalidad principal del proyecto, toma mediciones de distancia en 360° y guarda la información de posición y
	 * distancia en arreglos
	 */
	writeMsg(&handlerUSART1, "LiDAR Ranging starts\n");
	// Se reinician las variables necesarias
	float conversion = 0;
	counterRangigData = 0;
	restartPulses();
	// Se mueve de a 4 pasos el motor y cada 4 pasos se hace una medición, midiendo los angulos con los pulsos
	for (uint16_t k = 0; k < SIZE_RANGING_DATA; k++){
		RangingMeasurment();
		Pulses = getPulses();
		angleData[k] = Pulses;
		stepMotorMove(&StepMotor, 4, CLOCKWISE);
	}
	writeMsg(&handlerUSART1, "LiDAR Measurment finished. Wait the motor return to its original position to get the data\n");
	conversion = (float) SIZE_RANGING_DATA;
//	conversion = (conversion*1.40625)/Pulses; 			// Conversion para pasos de a 8
	conversion = (conversion*0.703125)/Pulses;			// Conversión para pasos de a 4
//	conversion = (conversion*0.17578125)/Pulses;		// Conversion para pasos de a 1
	// Se convierte la información de pulsos en ángulos
	for (uint16_t k = 0; k < SIZE_RANGING_DATA; k++){
		angleData[k] = angleData[k]*conversion;
	}
	// Se retorna el motor a su posición inicial
	stepMotorMove(&StepMotor, 2048, COUNTERCLOCKWISE);
	writeMsg(&handlerUSART1, "Now you can get the data\n");
}

void getRangingData(void){
	/**
	 * getRangingData se encarga de mostrar los datos de la medición por consola
	 */
	writeMsg(&handlerUSART1, "Angle(degrees)       Distance(mm)\n");
	for (uint16_t k = 0; k < SIZE_RANGING_DATA; k++){
		sprintf(bufferData, "%5f       %5f\n", angleData[k], rangingData[k]);
		writeMsg(&handlerUSART1, bufferData);
	}
}

void StaticRanging(unsigned int numData){
	/**
	 * StaticRanging hace numData mediciones con el sensor ToF
	 */
	while (numData > 0){
		counterRangigData = 0;
		RangingMeasurment();
		sprintf(bufferData, "Distance = %f mm\n",rangingData[0]);
		writeMsg(&handlerUSART1, bufferData);
		numData--;
		HAL_Delay(10);
	}
	writeMsg(&handlerUSART1, "The Static Ranging has finished");
}

