Ezapataq07/STM32_UNAL/VL53L3CX_SimpleRanging_F411/Core/Src/LiDAR_Main.c
void RangingMeasurment(void){
	/**
	 * RangingMeasurment se encarga de hacer una medición con el sensor ToF y guardarla en un arreglo, realmente hace 5 mediciones y toma el
	 * promedio. Está configurada para que no guarde medidas en caso de que sean erróneas, y que tome medidas solo cuando detecte un objeto
	 */
	int numObjects = 0;
	VL53LX_MultiRangingData_t MultiRangingData;
	VL53LX_MultiRangingData_t *pMultiRangingData = &MultiRangingData;
	uint8_t NewDataReady=0;
	uint8_t i = 0;
	HAL_Delay(2);
	if(status){
		writeMsg(&handlerUSART1, "VL53LX_StartMeasurement failed\n");
		while(1);
	}
	if (isInterrupt){
	do // HW interrupt mode
	{
	  __WFI();
	  if(IntCount !=0 ){
		IntCount=0;
		status = VL53LX_GetMultiRangingData(Dev, pMultiRangingData);
		numObjects = pMultiRangingData->NumberOfObjectsFound;
		RangeStatus = pMultiRangingData->RangeData->RangeStatus;
		// Control de errores, si se detecta un error se muestra por consola cúal es y se reinicia la medición
		// En caso de que hayan muchos errores se manda por consola un mensaje de error general
		if (RangeStatus){
			if (numMeasurmentErrors >= 3){
				writeMsg(&handlerUSART1, "The Tof Sensor is Failing, probably for the above reasons.\n");
			}
			RangeErrorsMsg(RangeStatus);
			numMeasurmentErrors++;
			HAL_Delay(250);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		// Control de múltiples objetos, si se detecta más de un objeto se reinicia la medición
		// En caso de que se detecte varias veces la presencia de más de un objeto se manda el mensaje por consola
		if (numObjects > 1){
			if (errorMultipleObjects >= 3){
				writeMsg(&handlerUSART1, "There are multiple objects to range. There must only be one.\n");
			}
			errorMultipleObjects++;
			HAL_Delay(250);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		meanRangingData += (float) pMultiRangingData->RangeData[0].RangeMilliMeter;
		i++;
		if (status==0){
		  status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
		}

	  }
	}
	while(i < 5);
	}
	else{
	do{ // polling mode
	  status = VL53LX_GetMeasurementDataReady(Dev, &NewDataReady);
	  HAL_Delay(2); // 1 ms polling period, could be longer.
	  if((!status)&&(NewDataReady!=0)){
		status = VL53LX_GetMultiRangingData(Dev, pMultiRangingData);
		RangeStatus = pMultiRangingData->RangeData->RangeStatus;
		if (RangeStatus){
			if (numMeasurmentErrors >= 10){
				printf("%s\n", "The Tof Sensor is Failing");
			}
			RangeErrors[numMeasurmentErrors] = RangeStatus;
			numMeasurmentErrors++;
			pMultiRangingData->RangeData[0].RangeMilliMeter = 0;
			HAL_Delay(500);
			status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
			continue;
		}
		printf("%5d", pMultiRangingData->RangeData[0].RangeMilliMeter);
		i++;
		numMeasurmentErrors = 0;
		printf ("\n");
		if (status==0){
		  status = VL53LX_ClearInterruptAndStartMeasurement(Dev);
		}
	  }
	}
	while (i < 1);
	}
	rangingData[counterRangigData] = meanRangingData/5.0;
	counterRangigData++;
	numMeasurmentErrors = 0;
	errorMultipleObjects = 0;
	meanRangingData = 0;
}

void initSystem(void){
	// Se configura el SysTick
	config_SysTickMs();

	/* Configuración del State LED */
	handlerStateLED.pGPIOx 								= GPIOC;
	handlerStateLED.GPIO_PinConfig.GPIO_PinNumber		= PIN_6;
	handlerStateLED.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;		// Se configura el PIN en modo OUTPUT
	handlerStateLED.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;	// Se define el OUTPUT TYPE como Push-Pull, para poder hacer el blinky
	handlerStateLED.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;	// Se configura el OUTPUT con una velocidad MEDIUM
	// Se carga la configuración del State LED
	GPIO_Config(&handlerStateLED);


	/* Configuración de las entradas para el Driver del motor */
	IN1.pGPIOx 										= GPIOC;
	IN1.GPIO_PinConfig.GPIO_PinNumber				= PIN_0;
	IN1.GPIO_PinConfig.GPIO_PinMode					= GPIO_MODE_OUT;
	IN1.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	IN1.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	GPIO_Config(&IN1);


	IN2.pGPIOx 										= GPIOC;
	IN2.GPIO_PinConfig.GPIO_PinNumber				= PIN_1;
	IN2.GPIO_PinConfig.GPIO_PinMode					= GPIO_MODE_OUT;
	IN2.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	IN2.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	GPIO_Config(&IN2);

	IN3.pGPIOx 										= GPIOC;
	IN3.GPIO_PinConfig.GPIO_PinNumber				= PIN_2;
	IN3.GPIO_PinConfig.GPIO_PinMode					= GPIO_MODE_OUT;
	IN3.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	IN3.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	GPIO_Config(&IN3);

	IN4.pGPIOx 										= GPIOC;
	IN4.GPIO_PinConfig.GPIO_PinNumber				= PIN_3;
	IN4.GPIO_PinConfig.GPIO_PinMode					= GPIO_MODE_OUT;
	IN4.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	IN4.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	GPIO_Config(&IN4);

	StepMotor.IN1 = &IN1;
	StepMotor.IN2 = &IN2;
	StepMotor.IN3 = &IN3;
	StepMotor.IN4 = &IN4;

	/* Configuración para el suicheo del Sensor */
	VL53L3CX_VDD.pGPIOx = GPIOB;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinNumber = PIN_13;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinOPType = GPIO_OTYPE_PUSHPULL;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPDR_NOTHING;
	VL53L3CX_VDD.GPIO_PinConfig.GPIO_PinSpeed = GPIO_OSPEED_HIGH;
	// Se carga la configuración y se inicia con el sensor apagado
	GPIO_Config(&VL53L3CX_VDD);
	GPIO_WritePin(&VL53L3CX_VDD, 0);

	/* Configuración del Timer2, que controla el blinky del StateLED */
	handlerStateLedTimer.ptrTIMx					= TIM2;
	handlerStateLedTimer.timerConfig.Timer_mode		= TIMER_MODE_UP;
	handlerStateLedTimer.timerConfig.Timer_speed	= TIMER_INCR_SPEED_100us;
	handlerStateLedTimer.timerConfig.Timer_period	= 2500;
	// Se carga la configuración del Timer2
	BTimer_Config(&handlerStateLedTimer);

	// Configuración del PIN que recibe la información por la USB (RX) */
	handlerRxPIN.pGPIOx								= GPIOA;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinNumber		= PIN_10;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinMode		= GPIO_MODE_ALTFN;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;
	handlerRxPIN.GPIO_PinConfig.GPIO_PinAltFunMode	= AF7;
	// Se carga la configuración del Rx PIN
	GPIO_Config(&handlerRxPIN);

