Ezapataq07/STM32_UNAL/VL53L3CX_SimpleRanging_F411/Core/Src/LiDAR_Main.c
	/* Configuración del PIN que envía la información por la USB (TX) */
	handlerTxPIN.pGPIOx								= GPIOA;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinNumber		= PIN_9;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinMode		= GPIO_MODE_ALTFN;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;
	handlerTxPIN.GPIO_PinConfig.GPIO_PinAltFunMode	= AF7;
	// Se carga la configuración del Tx PIN
	GPIO_Config(&handlerTxPIN);

	/* Configuración del USART1 */
	handlerUSART1.ptrUSARTx							= USART2;
	handlerUSART1.USART_Config.USART_mode			= USART_MODE_RXTX;
	handlerUSART1.USART_Config.USART_baudrate		= USART_BAUDRATE_115200;
	handlerUSART1.USART_Config.USART_datasize		= USART_DATASIZE_8BIT;
	handlerUSART1.USART_Config.USART_parity			= USART_PARITY_NONE;
	handlerUSART1.USART_Config.USART_stopbits		= USART_STOPBIT_1;
	handlerUSART1.USART_Config.USART_interrupt		= USART_INTERRUPT_RX;
	// Se carga la configuración del USART
	USART_Config(&handlerUSART1);

	/* Configuración para el output A del encoder */
	encoderOutA.pGPIOx 								= GPIOC;
	encoderOutA.GPIO_PinConfig.GPIO_PinNumber 		= PIN_15;
	encoderOutA.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_INPUT;
	encoderOutA.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	encoderOutA.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;
	// Se carga la configuración
	GPIO_Config(&encoderOutA);

	/* Configuració para el output B del encoder */
	encoderOutB.pGPIOx 								= GPIOC;
	encoderOutB.GPIO_PinConfig.GPIO_PinNumber 		= PIN_14;
	encoderOutB.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_INPUT;
	encoderOutB.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	encoderOutB.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_MEDIUM;
	// Se carga la configuración
	GPIO_Config(&encoderOutB);

	// Inicialización del EXTI en el driver del motor
	initStepMotor();


}

void Initial_Boot_VL53L3CX(void){
	/**
	 * Esta función se encarga de inicializar correctamente el Sensor ToF, en caso de no logralo se informará por consola
	 */
	uint8_t byteData;
	uint16_t wordData;
	uint8_t ToFSensor = 1; // 0=Left, 1=Center(default), 2=Right
	GPIO_WritePin(&VL53L3CX_VDD, 0);
	HAL_Delay(2000);
	GPIO_WritePin(&VL53L3CX_VDD, 1);
	HAL_Delay(2);
	XNUCLEO53L3A2_Init();
	ToFSensor = 'c'; // Select ToFSensor: 0=Left, 1=Center, 2=Right
	status = XNUCLEO53L3A2_ResetId(ToFSensor, 0); // Reset ToF sensor
	HAL_Delay(2);
	status = XNUCLEO53L3A2_ResetId(ToFSensor, 1); // Reset ToF sensor
	HAL_Delay(2);
	VL53LX_RdByte(Dev, 0x010F, &byteData);
	sprintf(bufferData, "VL53LX Model_ID: %02X\n\r", byteData);
	writeMsg(&handlerUSART1, bufferData);
	VL53LX_RdByte(Dev, 0x0110, &byteData);
	sprintf(bufferData, "VL53LX Module_Type: %02X\n\r", byteData);
	writeMsg(&handlerUSART1, bufferData);
	VL53LX_RdWord(Dev, 0x010F, &wordData);
	sprintf(bufferData, "VL53LX: %02X\n\r", wordData);
	writeMsg(&handlerUSART1, bufferData);
	  //////////////////////////////////////////////////////////////////////////////////////////////////
	status = VL53LX_WaitDeviceBooted(Dev);
	while(status != VL53LX_ERROR_NONE){
		writeMsg(&handlerUSART1, "Not Booted\n");
		status = VL53LX_WaitDeviceBooted(Dev);
		HAL_Delay(10);
	}
	writeMsg(&handlerUSART1, "Device Booted\n");
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	status = VL53LX_DataInit(Dev);
	while(status != VL53LX_ERROR_NONE){
		status = VL53LX_DataInit(Dev);
		HAL_Delay(10);
		writeMsg(&handlerUSART1, "Not Initialized\n");
	}
	writeMsg(&handlerUSART1, "Device Initialized\n");
	status = VL53LX_SetDistanceMode(Dev, VL53LX_DISTANCEMODE_MEDIUM);
	///////////////////////////////////////////////////////////////////////////////////////////////////
	status = 1;
	while(status != VL53LX_ERROR_NONE){
		status = VL53LX_StartMeasurement(Dev);
		HAL_Delay(10);
		writeMsg(&handlerUSART1, "Not Measuring\n");
	}
	writeMsg(&handlerUSART1, "Device ready to measure\n");
//	status = VL53LX_PerformRefSpadManagement(Dev);
//	status = VL53LX_SmudgeCorrectionEnable(Dev, VL53LX_SMUDGE_CORRECTION_CONTINUOUS);
//	status = VL53LX_SetXTalkCompensationEnable(Dev, 1);
//	status = VL53LX_SetOffsetCorrectionMode(Dev, VL53LX_OFFSETCORRECTIONMODE_STANDARD);
//	status = VL53LX_PerformOffsetZeroDistanceCalibration(Dev);
//	status = VL53LX_PerformXTalkCalibration(Dev);
}

void RangeErrorsMsg(uint8_t status){
	/**
	 * Esta función contiene los posibles errores que pueden darse durante la etapa de medición, con su respectivo mensaje de error por consola
	 */
	switch(status){
	case VL53LX_RANGESTATUS_SIGMA_FAIL:
	{
		writeMsg(&handlerUSART1, "Sigma estimator outofbounds\n");
		break;
	}
	case VL53LX_RANGESTATUS_SIGNAL_FAIL:
	{
		writeMsg(&handlerUSART1, "Signal too low to detect target\n");
		break;
	}
	case VL53LX_RANGESTATUS_OUTOFBOUNDS_FAIL:
	{
		writeMsg(&handlerUSART1, "Target out of bounds\n");
		break;
	}
	case VL53LX_RANGESTATUS_HARDWARE_FAIL:
	{
		writeMsg(&handlerUSART1, "Hardware or Tof sensor failure\n");
		break;
	}
	case VL53LX_RANGESTATUS_RANGE_VALID_NO_WRAP_CHECK_FAIL:
	{
		writeMsg(&handlerUSART1, "No wraparound check has been done (this is the very first range)\n");
		break;
	}
	case VL53LX_RANGESTATUS_WRAP_TARGET_FAIL:
	{
		writeMsg(&handlerUSART1, "Wraparound occurred\n");
		break;
	}
	case VL53LX_RANGESTATUS_PROCESSING_FAIL:
	{
		writeMsg(&handlerUSART1, "Internal processing error\n");
		break;
	}
	case VL53LX_RANGESTATUS_SYNCRONISATION_INT:
	{
		writeMsg(&handlerUSART1, "Raised one time after init, ranging value has to be ignored\n");
		break;
	}
	case VL53LX_RANGESTATUS_RANGE_VALID_MERGED_PULSE:
	{
		writeMsg(&handlerUSART1, "Ranging is OK, but distance reported is the result of multiple targets merged together.\n");
		break;
	}
	case VL53LX_RANGESTATUS_TARGET_PRESENT_LACK_OF_SIGNAL:
	{
		writeMsg(&handlerUSART1, "There is a target, but signal is too low to report ranging\n");
		break;
	}
	case VL53LX_RANGESTATUS_RANGE_INVALID:
	{
		writeMsg(&handlerUSART1, "Ranging data is negative and has to be ignored\n");
		break;
	}
	case VL53LX_RANGESTATUS_NONE:
	{
		writeMsg(&handlerUSART1, "Target not detected, without no warning or errors raised\n");
		break;
	}
	default:
	{
		break;
	}
	}
}

/* Implementacion del Callback para el timer2 */
void BTimer2_Callback(void){
	handlerStateLED.pGPIOx->ODR ^= GPIO_ODR_OD6;
}

/* Implementacion del Callback para el Usart2 */
void Usart2_RX_Callback(void){
	rxData = getRxData();
}

void WelcomeMsg(void){
	writeMsg(&handlerUSART1, "\n");
	writeMsg(&handlerUSART1, " @@@@  @@@@@     @@    @@ @@@@@   @@@@  @@@@@      @@@@  @@@@ @@  @@  @@@@   @@@@  @@@@@ \n");
	writeMsg(&handlerUSART1, "@@  @@ @@  @@    @@       @@  @@ @@  @@ @@  @@    @@     @@   @@@ @@ @@     @@  @@ @@  @@\n");
	writeMsg(&handlerUSART1, "   @@  @@  @@    @@    @@ @@  @@ @@@@@@ @@@@@      @@@@  @@@@ @@ @@@  @@@@  @@  @@ @@@@@_\n");
	writeMsg(&handlerUSART1, " @@    @@  @@    @@    @@ @@  @@ @@  @@ @@  @@        @@ @@   @@  @@     @@ @@  @@ @@  @@\n");
	writeMsg(&handlerUSART1, "@@@@@  @@@@@     @@@@@ @@ @@@@@  @@  @@ @@  @@     @@@@  @@@@ @@  @@  @@@@   @@@@  @@  @@\n\n");
	writeMsg(&handlerUSART1, "Write 'Menu @' to see the options\n");
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
